c1 = str(input("Введите первый цвет:"))
c2 = str(input("Введите второй цвет:"))
if c1 != "красный" and c1 != "синий" and c1 != "желтый" and c2 != "красный" and c2 != "синий" and c2 != "желтый":
    print("Ошибка")
else:
    if (c1 == "красный" and c2 == "синий") or (c2 == "красный" and c1 == "синий"):
        print ("фиолетовый")
    if (c1 == "красный" and c2 == "желтый") or (c2 == "красный" and c1 == "желтый"):
        print ("оранжевый")
    if (c1 == "желтый" and c2 == "синий") or (c2 == "желтый" and c1 == "синий"):
        print ("зеленый")
    if (c1 == "желтый" and c2 == "желтый"):
        print ("желтый")
    if (c1 == "синий" and c2 == "синий"):
        print("синий")
    if (c1 == "красный" and c2 == "красный"):
        print("красный")